ror_pms/app/controllers/Users/registrations_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    super
    params[:tech] = params[:tech].to_json
    resource.add_role Role.find(params[:user][:roles]).name.to_sym